Tekla.Structures.Model.ControlCircle
The ControlCircle class defines a user defined (not magnetic) circle helping in modeling work.
If there are duplicated input points or 3 input points are in a line, ControlCircle.Insert() will return false.
ControlCircle.Select() will return the center point of the circle to Point1.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point p1 = new Point(4500, 4500, 0);
Point p2 = new Point(4500, 9000, 0);
Point p3 = new Point(0, 0, 0);
ControlCircle controlCircle = new ControlCirle(p1, p2, p3);
bool Result = false;
Result = ControlCircle.Insert();
}
}

Tekla.Structures.Model.ControlCircle.#ctor
Initializes a new instance of the Tekla.Structures.Model.ControlCircle class.
The default values are as follows:
Color = ControlCircleColorEnum.YELLOW;
Extension = 0.0;

Tekla.Structures.Model.ControlCircle.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.Model.ControlCircle class.
The control circle is not magnetic.
point1:  The first point to be used.
point2:  The second point to be used.
point3:  The third point to be used.

Tekla.Structures.Model.ControlCircle.Extension
Gets or sets the extension of the control circle.

Tekla.Structures.Model.ControlCircle.Color
Gets or sets the color of the control circle.

Tekla.Structures.Model.ControlCircle.LineType
The line type of the control circle.

Tekla.Structures.Model.ControlCircle.Point1
Gets or sets the first point.
Point1 becomes the center point of the circle after selecting the control circle.

Tekla.Structures.Model.ControlCircle.Point2
Gets or sets the second point.
Point2 contains the original input Point1 after selecting the control circle.

Tekla.Structures.Model.ControlCircle.Point3
Gets or sets the third point.
Point3 contains the calculated result from the orthogonal point and the center point after selecting the control circle.

Tekla.Structures.Model.ControlCircle.Insert
Inserts the control circle into the model.
Returns: True on success.

Tekla.Structures.Model.ControlCircle.Select
Selects the control circle with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlCircle.Modify
Modifies the control circle with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlCircle.Delete
Deletes the control circle with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlCircle.ToStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Converts the dot object into the struct data structure.
dotControlObjectT:  The dot object as conversion input.

Tekla.Structures.Model.ControlCircle.FromStruct(Tekla.Structures.ModelInternal.dotControlObject_t@)
Converts the object from the struct data structure to the dot format.
dotControlObjectT:  The dot object as conversion output.

Tekla.Structures.Model.ControlCircle.CreateInstance
Creates the instance.
Returns:  The System.Boolean.

Tekla.Structures.Model.ControlCircle.SelectInstance
Selects the instance.
Returns:  The System.Boolean.

Tekla.Structures.Model.ControlCircle.ModifyInstance
Modifies the instance.
Returns:  The System.Boolean.